_Rarzrabotki/Rarus/USO2/DataProcessors/уатЗагрузитьЗаправкиИзОтчетовПЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>уатЗагрузитьЗаправкиИзОтчетовПЦ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПроверенные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаПоискаПЛДоВыезда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаПоискаПЛПослеВозвращения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковТЖ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/уатОборотыПоОтчетамПоставщиковПЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>уатОборотыПоОтчетамПоставщиковПЦ</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Comment>Стоимость в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в регл. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПластиковаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТопливныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТСотчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АЗС</Name>
					<Comment>АЗС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураОтчета</Name>
					<Comment>Номенклатура отчета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПластиковаяКартаОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/уатОборотыПоЗаправкамГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>уатОборотыПоЗаправкамГСМ</Name>
			<Comment>Обороты по заправкам ГСМ (уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТалонов</Name>
					<Comment>Количество выданных талонов на заправку. Имеет смысл только для заправок по талонам </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АЗС</Name>
					<Comment>АЗС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗаправки</Name>
					<Comment>Вид заправки ГСМ</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыДвиженияГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Comment>Водитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>ГСМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Колонна</Name>
					<Comment>Колонна</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураТалонов</Name>
					<Comment>Номенклатура талонов ГСМ. Имеет смысл только для заправок по талонам.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомераТалонов</Name>
					<Comment>Номера талонов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПластиковаяКарта</Name>
					<Comment>Пластиковая карта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТопливныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Comment>Путевой лист</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатГруппыГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатГруппыГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Масло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисадкиИТехническиеЖидкости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатВидыОперацийСливГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийСливГСМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
					<Comment>Слив ГСМ на склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаТС</Name>
					<Comment>Слив ГСМ на другое ТС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАЗС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатВидыДвиженияГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатВидыДвиженияГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаНаличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаПластиковаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаПластиковаяКартаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаПоставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаТалоны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/уатЗагрузитьЗаправкиИзОтчетовПЦ/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	//сформируем список ГСМ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	уатНоменклатураГСМ.Номенклатура.Ссылка КАК ГСМ
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|ГДЕ
	|	уатНоменклатураГСМ.ГруппаГСМ = &ГруппаГСМ";
	
	Запрос.УстановитьПараметр("ГруппаГСМ", Перечисления.уатГруппыГСМ.Топливо);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокГСМ.Очистить();
	Пока Выборка.Следующий() Цикл
		СписокГСМ.Добавить(Выборка.ГСМ);
	КонецЦикла;
	
	//сформируем список ТК
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатТопливныеКарты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатТопливныеКарты КАК уатТопливныеКарты";
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокТК.Очистить();
	Пока Выборка.Следующий() Цикл
		СписокТК.Добавить(Выборка.Ссылка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ЗагрузитьНастройки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ПроверкаКорректности(Новый ОписаниеОповещения("ВыполнитьОбработкуЗавершение1", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТКПоАЗС(Команда)
	ЗаполнитьТКПоОтбору(СписокТК, "КемВыдана", Объект.АЗС);
КонецПроцедуры

&НаКлиенте
Процедура СписокТКПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТКПоКонтрагенту(Команда)
	ЗаполнитьТКПоОтбору(СписокТК, "КемВыдана", Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуЗавершение1(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Группа4.ТекущаяСтраница = Элементы.Группа5;
	
	ОбработанныеДокументы.Очистить();
	
	ТекстИндикатора = НСтр("en='Loading data from PC documents ...';ru='Загрузка данных из документов ПЦ ...'");
	
	ВыполнитьОбработкуСервер();
	
	ТекстИндикатора = "";
	Элементы.Группа4.ТекущаяСтраница = Элементы.Группа6;
	
	КоличДок = 0;
	Для Каждого ТекСтрока Из ОбработанныеДокументы Цикл
		Если ТипЗнч(ТекСтрока.Значение) = Тип("ДокументСсылка.уатЗаправкаГСМ")
			ИЛИ ТипЗнч(ТекСтрока.Значение) = Тип("ДокументСсылка.уатСливГСМ") Тогда
			КоличДок = КоличДок + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ОткрыватьФормыЗаписанныхЗаправок Тогда
		флОткрытьФормы = Истина;
		Если КоличДок > 50 Тогда
			Ответ = Неопределено;
			
			ТекстНСТР = НСтр("en='Number of processed fuelings and drains exceeds 50! Open document forms?';ru='Количество обработанных заправок и сливов превышает 50! Открыть формы документов?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьОбработкуЗавершение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
			Возврат;
		КонецЕсли;
		
		ВыполнитьОбработкуФрагмент(флОткрытьФормы);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ <> КодВозвратаДиалога.ОК Тогда
        флОткрытьФормы = Ложь;
    КонецЕсли;
    
    ВыполнитьОбработкуФрагмент(флОткрытьФормы);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуФрагмент(Знач флОткрытьФормы)
    
    Перем ТекСтрока;
    
    Если флОткрытьФормы Тогда
        Для Каждого ТекСтрока Из ОбработанныеДокументы Цикл
            Если ТипЗнч(ТекСтрока.Значение) = Тип("ДокументСсылка.уатЗаправкаГСМ")
                ИЛИ ТипЗнч(ТекСтрока.Значение) = Тип("ДокументСсылка.уатСливГСМ") Тогда
                ПоказатьЗначение(Неопределено, ТекСтрока.Значение);
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуСервер()
	Перем мДокументЗаправкаСлив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатОборотыПоОтчетамПоставщиковПЦ.ТС КАК ТС,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Номенклатура КАК ГСМ,
	|	уатОборотыПоОтчетамПоставщиковПЦ.ПластиковаяКарта КАК ПластиковаяКарта,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Валюта КАК Валюта,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Количество КАК Количество,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Стоимость КАК Стоимость,
	|	уатОборотыПоОтчетамПоставщиковПЦ.СтавкаНДС КАК СтавкаНДС,
	|	уатОборотыПоОтчетамПоставщиковПЦ.СуммаНДС КАК СуммаНДС,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Период КАК Период,
	|	уатОборотыПоОтчетамПоставщиковПЦ.АЗС КАК АЗС,
	|	ВЫБОР
	|		КОГДА уатОборотыПоОтчетамПоставщиковПЦ.Регистратор ССЫЛКА Документ.уатОтчетПоставщикаПЦ
	|			ТОГДА уатОборотыПоОтчетамПоставщиковПЦ.Регистратор.УчитыватьНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК УчитыватьНДС,
	|	ВЫБОР
	|		КОГДА уатОборотыПоОтчетамПоставщиковПЦ.Регистратор ССЫЛКА Документ.уатОтчетПоставщикаПЦ
	|			ТОГДА уатОборотыПоОтчетамПоставщиковПЦ.Регистратор.СуммаВключаетНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА уатОборотыПоОтчетамПоставщиковПЦ.Регистратор ССЫЛКА Документ.уатОтчетПоставщикаПЦ
	|			ТОГДА уатОборотыПоОтчетамПоставщиковПЦ.Регистратор.Контрагент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Контрагент
	|ИЗ
	|	РегистрНакопления.уатОборотыПоОтчетамПоставщиковПЦ КАК уатОборотыПоОтчетамПоставщиковПЦ
	|ГДЕ
	|	уатОборотыПоОтчетамПоставщиковПЦ.Период МЕЖДУ &ДатаНач И &ДатаКон";
	Если ЗначениеЗаполнено(Объект.АЗС) Тогда
		Запрос.Текст = Запрос.Текст + " 
		|	И уатОборотыПоОтчетамПоставщиковПЦ.АЗС = &АЗС";
		Запрос.УстановитьПараметр("АЗС", Объект.АЗС);
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + " 
	|	И уатОборотыПоОтчетамПоставщиковПЦ.Организация = &Организация";
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Запрос.Текст = Запрос.Текст + " 
		|	И уатОборотыПоОтчетамПоставщиковПЦ.АЗС.Контрагент_Склад = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	КонецЕсли;
	
	СписокОтмеченныхТК = Новый СписокЗначений; 
	Для Каждого ТекСтрока Из СписокТК Цикл
		Если ТекСтрока.Пометка Тогда
			СписокОтмеченныхТК.Добавить(ТекСтрока.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокОтмеченныхТК.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " 
		|	И уатОборотыПоОтчетамПоставщиковПЦ.ПластиковаяКарта В(&СписокТК)";
		Запрос.УстановитьПараметр("СписокТК", СписокОтмеченныхТК);
	КонецЕсли;

	Запрос.Текст = Запрос.Текст + " 
	|	И уатОборотыПоОтчетамПоставщиковПЦ.Номенклатура В(&СписокГСМ)
	|	И (уатОборотыПоОтчетамПоставщиковПЦ.Количество <> 0
	|			ИЛИ уатОборотыПоОтчетамПоставщиковПЦ.Стоимость <> 0)"
	+ ?(Объект.ТолькоПроверенные, "	И уатОборотыПоОтчетамПоставщиковПЦ.Проверено
	|", "") + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	СписокОтмеченныхГСМ = Новый СписокЗначений; 
	Для Каждого ТекСтрока Из СписокГСМ Цикл
		Если ТекСтрока.Пометка Тогда
			СписокОтмеченныхГСМ.Добавить(ТекСтрока.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СписокГСМ",   СписокОтмеченныхГСМ);
	Запрос.УстановитьПараметр("ДатаНач",     Объект.ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",     КонецДня(Объект.ДатаКон));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Индекс             = 0;
	мсвВыборкаЗаправки = Новый Массив();
	мсвВыборкаСливы    = Новый Массив();
	Пока Выборка.Следующий() Цикл
		СтруктураСтроки = Новый Структура();
		СтруктураСтроки.Вставить("НомерСтроки",      Индекс);
		СтруктураСтроки.Вставить("Контрагент",       Выборка.Контрагент);
		СтруктураСтроки.Вставить("АЗС",              Выборка.АЗС);
		СтруктураСтроки.Вставить("ТС",               Выборка.ТС);
		СтруктураСтроки.Вставить("ГСМ",              Выборка.ГСМ);
		СтруктураСтроки.Вставить("ПластиковаяКарта", Выборка.ПластиковаяКарта);
		СтруктураСтроки.Вставить("Валюта",           Выборка.Валюта);
		СтруктураСтроки.Вставить("Количество",       Выборка.Количество);
		СтруктураСтроки.Вставить("Стоимость",        Выборка.Стоимость);
		СтруктураСтроки.Вставить("Период",           Выборка.Период);
		СтруктураСтроки.Вставить("СтавкаНДС",        Выборка.СтавкаНДС);
		СтруктураСтроки.Вставить("СуммаНДС",         Выборка.СуммаНДС);
		СтруктураСтроки.Вставить("УчитыватьНДС",     Выборка.УчитыватьНДС);
		СтруктураСтроки.Вставить("СуммаВключаетНДС", Выборка.СуммаВключаетНДС);
		СтруктураСтроки.Вставить("КоличествоСлив",   0);
		СтруктураСтроки.Вставить("ЕстьДубли",        Ложь);
		СтруктураСтроки.Вставить("Дубли",            "");
		
		Если Выборка.Количество > 0 Тогда
			мсвВыборкаЗаправки.Добавить(СтруктураСтроки);
		Иначе
			// Анализируем возврат ГСМ и вычитаем его из записи прихода
			Если НЕ СоздаватьСливыДляОтрицательныхЗаправок Тогда
				ИндексСтроки = мсвВыборкаЗаправки.Количество() - 1;
				Пока ИндексСтроки >= 0 Цикл
					Если Выборка.ТС = мсвВыборкаЗаправки[ИндексСтроки].ТС И Выборка.ГСМ = мсвВыборкаЗаправки[ИндексСтроки].ГСМ 
						И Выборка.Валюта = мсвВыборкаЗаправки[ИндексСтроки].Валюта Тогда
						мсвВыборкаЗаправки[ИндексСтроки].КоличествоСлив = мсвВыборкаЗаправки[ИндексСтроки].КоличествоСлив + Выборка.Количество;
						Прервать;
					КонецЕсли;
					ИндексСтроки = ИндексСтроки - 1;
				КонецЦикла;
			КонецЕсли;
			мсвВыборкаСливы.Добавить(СтруктураСтроки);
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	СписокПЛ = Новый СписокЗначений;
	
	ТекОтветственный = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.АвторизованныйПользователь(), "ОсновнойОтветственный");
	НастройкиПользователя_ОсновнаяСтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
	НастройкиОрганизации_УчитыватьНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.УчитыватьНДС);
	НастройкиОрганизации_СуммаВключаетНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.СуммаВключаетНДС);
		
	Если ПроверятьНаличееДублейПоСозданнымРанееДокументам = 1 
		ИЛИ ПроверятьНаличееДублейПоСозданнымРанееДокументам = 2 Тогда
		
		мсвДляУдаления = Новый Массив;
		Для Каждого ВыборкаЗапроса Из мсвВыборкаЗаправки Цикл
			
			ЕстьДубли      = Ложь;
			ТекстСообщения = "";
			ЕстьДубли      = ПроверитьНаличиеДублей(ВыборкаЗапроса.Период, ВыборкаЗапроса.АЗС, ВыборкаЗапроса.Контрагент, Объект.Организация, ВыборкаЗапроса.ГСМ, ВыборкаЗапроса.ТС, ВыборкаЗапроса.ПластиковаяКарта, ВыборкаЗапроса.Количество + ВыборкаЗапроса.КоличествоСлив, ТекстСообщения);
			Если ЕстьДубли Тогда
				ВыборкаЗапроса.ЕстьДубли = Истина;
				ВыборкаЗапроса.Дубли     = ТекстСообщения;
				
				Если ПроверятьНаличееДублейПоСозданнымРанееДокументам = 1 Тогда
					ТекстНСТР = НСтр("en='Earlier the document was posted ""Fuelling"" with key fields:';ru='Ранее был проведен документ ""Заправка ГСМ"" с ключевыми полями:'") 
					+ Символы.ПС + СтрШаблон(НСтр("en='Date: %1; Company: %2; Gas station: %3; Counterparties: %4; Fuels: %5; Vehicle: %6, Fuel card: %7; Quantity: %8';ru='Дата заправки: %1; Организация: %2; АЗС: %3; Контрагент: %4; ГСМ: %5; ТС: %6, Топливная карта: %7; Количество: %8'"),
					ВыборкаЗапроса.Период, Объект.Организация, ВыборкаЗапроса.АЗС, ВыборкаЗапроса.АЗС.Контрагент_Склад, ВыборкаЗапроса.ГСМ, ВыборкаЗапроса.ТС, ВыборкаЗапроса.ПластиковаяКарта, ВыборкаЗапроса.Количество + ВыборкаЗапроса.КоличествоСлив)
					+ Символы.ПС + ТекстСообщения;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
					мсвДляУдаления.Добавить(ВыборкаЗапроса);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПроверятьНаличееДублейПоСозданнымРанееДокументам = 1 Тогда
			Для Каждого ВыборкаЗапроса Из мсвДляУдаления Цикл
				Индекс = мсвВыборкаЗаправки.Найти(ВыборкаЗапроса);
				Если Индекс <> Неопределено Тогда
					мсвВыборкаЗаправки.Удалить(Индекс);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		мсвДляУдаления = Новый Массив;
		Для Каждого ВыборкаЗапроса Из мсвВыборкаСливы Цикл
			
			ЕстьДубли      = Ложь;
			ТекстСообщения = "";
			ЕстьДубли      = ПроверитьНаличиеДублейСливы(ВыборкаЗапроса.Период, ВыборкаЗапроса.АЗС, Объект.Организация, ВыборкаЗапроса.ГСМ, ВыборкаЗапроса.ТС, -ВыборкаЗапроса.Количество, ТекстСообщения);
			Если ЕстьДубли Тогда
				ВыборкаЗапроса.ЕстьДубли = Истина;
				ВыборкаЗапроса.Дубли     = ТекстСообщения;
				
				Если ПроверятьНаличееДублейПоСозданнымРанееДокументам = 1 Тогда
					ТекстНСТР = НСтр("en='Earlier the document was posted ""Fuelling"" with key fields:';ru='Ранее был проведен документ ""Слив ГСМ"" с ключевыми полями:'") 
					+ Символы.ПС + СтрШаблон(НСтр("en='Date: %1; Company: %2; Gas station: %3; Counterparties: %4; Fuels: %5; Vehicle: %6, Fuel card: %7; Quantity: %8';ru='Дата заправки: %1; Организация: %2; АЗС: %3; Контрагент: %4; ГСМ: %5; ТС: %6, Топливная карта: %7; Количество: %8'"),
					ВыборкаЗапроса.Период, Объект.Организация, ВыборкаЗапроса.АЗС, ВыборкаЗапроса.АЗС.Контрагент_Склад, ВыборкаЗапроса.ГСМ, ВыборкаЗапроса.ТС, ВыборкаЗапроса.ПластиковаяКарта, ВыборкаЗапроса.Количество + ВыборкаЗапроса.КоличествоСлив)
					+ Символы.ПС + ТекстСообщения;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
					мсвДляУдаления.Добавить(ВыборкаЗапроса);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПроверятьНаличееДублейПоСозданнымРанееДокументам = 1 Тогда
			Для Каждого ВыборкаЗапроса Из мсвДляУдаления Цикл
				Индекс = мсвВыборкаСливы.Найти(ВыборкаЗапроса);
				Если Индекс <> Неопределено Тогда
					мсвВыборкаСливы.Удалить(Индекс);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	КолСтрок	 = мсвВыборкаЗаправки.Количество();
	Инд			 = 0;
	Дата1		 = '00010101';
	флЗаписать	 = Ложь;
	мОтказ		 = Ложь;
	ВидОперацииСливГСМ		 = ?(Объект.АЗС.ЭтоАЗССклад, Перечисления.уатВидыОперацийСливГСМ.НаСклад, Перечисления.уатВидыОперацийСливГСМ.НаАЗС);
	ВидОперацииЗаправкаГСМ	 = ?(Объект.АЗС.ЭтоАЗССклад, Перечисления.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКартаСклад, Перечисления.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКарта);
	
	СообщениеПредупреждение = "";
	
	Для Каждого ВыборкаЗапроса Из мсвВыборкаЗаправки Цикл
		Инд = Инд + 1;
		ЗначениеИндикатора = Инд / КолСтрок * 100;
		
		Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(ВыборкаЗапроса.ТС) Тогда
			Продолжить;
		КонецЕсли;	
		
		Если Дата1 <> ВыборкаЗапроса.Период Тогда
			
			Если Дата1 <> '00010101' Тогда
				Попытка
					Если ПроводитьСозданныеЗаправкиГСМ Тогда
						мДокументЗаправкаСлив.Записать(РежимЗаписиДокумента.Проведение);
					Иначе
						мДокументЗаправкаСлив.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СообщениеПредупреждение) Тогда
						СообщениеПредупреждение = СтрШаблон(СообщениеПредупреждение, мДокументЗаправкаСлив);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПредупреждение);
					КонецЕсли;
					
					Если ПроверятьНаличееДублейПоСозданнымРанееДокументам = 2 
						И ВыборкаЗапроса.ЕстьДубли Тогда
						ТекстНСТР = СтрШаблон(НСтр("en='The document ""%1"" ';ru='У документа ""%1"" '"), мДокументЗаправкаСлив.Ссылка) +НСтр("en='there are doubles:';ru='существуют дубли:'")
						+ Символы.ПС + ВыборкаЗапроса.Дубли;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
					КонецЕсли;
					
					ОбработанныеДокументы.Добавить(мДокументЗаправкаСлив.Ссылка);
					
					Если ФлажокКомментироватьХодВыполнения Тогда
						ТекстНСТР = НСтр("en='Recorded document:';ru='Записан документ:'") + " <" + мДокументЗаправкаСлив + ">";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
					КонецЕсли;
				Исключение
				КонецПопытки;
				
				флЗаписать = Ложь;
			КонецЕсли;
			
			Дата1 = ВыборкаЗапроса.Период;
			
			СообщениеПредупреждение = "";
			мДокументЗаправкаСлив = Документы.уатЗаправкаГСМ.СоздатьДокумент();
			Если ВыборкаЗапроса.УчитыватьНДС = Неопределено Тогда //это иной документ, например Корректировка записей регистров - нестандартная ситуация
				мДокументЗаправкаСлив.УчитыватьНДС = НастройкиОрганизации_УчитыватьНДС;
				мДокументЗаправкаСлив.СуммаВключаетНДС = НастройкиОрганизации_СуммаВключаетНДС;
			Иначе //это документ Отчет ПЦ
				мДокументЗаправкаСлив.УчитыватьНДС = ВыборкаЗапроса.УчитыватьНДС;
				мДокументЗаправкаСлив.СуммаВключаетНДС = ВыборкаЗапроса.СуммаВключаетНДС;
			КонецЕсли;
					
			мДокументЗаправкаСлив.ВидДвиженияГСМ = ВидОперацииЗаправкаГСМ;
			Если ТипЗнч(Объект.АЗС.Контрагент_Склад) = Тип("СправочникСсылка.Контрагенты") Тогда
				мДокументЗаправкаСлив.ДоговорКонтрагента = уатЗаполнениеДокументов.ПолучитьОсновнойДоговорКонтрагента(Объект.АЗС.Контрагент_Склад, "СПоставщиком");
			КонецЕсли;
			
			мДокументЗаправкаСлив.Дата			 = Дата1;
			мДокументЗаправкаСлив.АЗС			 = Объект.АЗС;
			мДокументЗаправкаСлив.Организация	 = Объект.Организация;
			мДокументЗаправкаСлив.Ответственный	 = ТекОтветственный;
			
			флЗаписать = Истина;
			
		КонецЕсли;
		
		НоваяСтрока = мДокументЗаправкаСлив.Заправки.Добавить();
		НоваяСтрока.Дата		 = Дата1;
		НоваяСтрока.ГСМ			 = ВыборкаЗапроса.ГСМ;
		НоваяСтрока.ТС			 = ВыборкаЗапроса.ТС;
		
		МестоТС = уатОбщегоНазначения.МестонахождениеТС(ВыборкаЗапроса.ТС, Дата1);
		Если ЗначениеЗаполнено(мДокументЗаправкаСлив.ПодразделениеОрганизации) И
			мДокументЗаправкаСлив.ПодразделениеОрганизации <> МестоТС.Подразделение
			ИЛИ ЗначениеЗаполнено(мДокументЗаправкаСлив.Колонна) И мДокументЗаправкаСлив.Колонна <> МестоТС.Колонна Тогда
			СообщениеПредупреждение = НСтр("ru = 'В документе %1 колонна и подразделение не были заполнены, так как в списке присутствуют ТС с различным местоположением.'");
			мДокументЗаправкаСлив.ПодразделениеОрганизации	 = Неопределено;
			мДокументЗаправкаСлив.Колонна					 = Неопределено;
		Иначе
			мДокументЗаправкаСлив.ПодразделениеОрганизации	 = МестоТС.Подразделение;
			мДокументЗаправкаСлив.Колонна					 = МестоТС.Колонна;
		КонецЕсли;

		НоваяСтрока.Цена		 = ВыборкаЗапроса.Стоимость / ?(ВыборкаЗапроса.Количество = 0, 1, ВыборкаЗапроса.Количество);
		НоваяСтрока.Количество	 = ВыборкаЗапроса.Количество + ВыборкаЗапроса.КоличествоСлив;
		НоваяСтрока.Сумма		 = ?(ЗначениеЗаполнено(ВыборкаЗапроса.КоличествоСлив) , НоваяСтрока.Количество * НоваяСтрока.Цена, ВыборкаЗапроса.Стоимость);
		
		Если ВыборкаЗапроса.УчитыватьНДС = Неопределено Тогда //это иной документ, например Корректировка записей регистров - нестандартная ситуация
			НоваяСтрока.СтавкаНДС = НастройкиПользователя_ОсновнаяСтавкаНДС;
			НоваяСтрока.СуммаНДС  = уатОбщегоНазначенияТиповые.уатРассчитатьСуммуНДС(НоваяСтрока.Сумма,
				мДокументЗаправкаСлив.УчитыватьНДС, мДокументЗаправкаСлив.СуммаВключаетНДС,
				уатОбщегоНазначенияТиповые.уатПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		Иначе //это документ Отчет ПЦ
			НоваяСтрока.СтавкаНДС = ВыборкаЗапроса.СтавкаНДС;
			НоваяСтрока.СуммаНДС  = ?(ЗначениеЗаполнено(ВыборкаЗапроса.КоличествоСлив), уатОбщегоНазначенияТиповые.уатРассчитатьСуммуНДС(НоваяСтрока.Сумма,
				мДокументЗаправкаСлив.УчитыватьНДС, мДокументЗаправкаСлив.СуммаВключаетНДС,
				уатОбщегоНазначенияТиповые.уатПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС)), ВыборкаЗапроса.СуммаНДС);
		КонецЕсли;
			
		Если ВыборкаЗапроса.УчитыватьНДС = Истина И ВыборкаЗапроса.СуммаВключаетНДС = Ложь Тогда
			НоваяСтрока.Сумма = НоваяСтрока.Сумма - ВыборкаЗапроса.СуммаНДС;
		Иначе
			НоваяСтрока.Сумма = НоваяСтрока.Сумма;
		КонецЕсли;
		
		НоваяСтрока.Валюта				 = ВыборкаЗапроса.Валюта;
		НоваяСтрока.ПластиковаяКарта	 = ВыборкаЗапроса.ПластиковаяКарта;
		
		//теперь найдем путевой лист
		ВремяВыезд      = Объект.ГлубинаПоискаПЛДоВыезда;
		ВремяВозврат    = Объект.ГлубинаПоискаПЛПослеВозвращения;
		
		ТаблицаПЛ = уатОбщегоНазначения.уатПутевыеЛистыВыездВозврат(ВыборкаЗапроса.ТС,Дата1, ВремяВыезд, 
				ВремяВозврат, , ?(ОбрабатыватьРассчитанныеПутевыеЛисты, Неопределено, Ложь));
			
		Если ТаблицаПЛ.Количество() > 0 Тогда
			Если СоздаватьСливыДляОтрицательныхЗаправок И ВыборкаЗапроса.Количество < 0 Тогда
				мДокументЗаправкаСлив.ПутевойЛист = ТаблицаПЛ[0].Ссылка;
				Если СписокПЛ.НайтиПоЗначению(мДокументЗаправкаСлив.ПутевойЛист) = Неопределено Тогда
					СписокПЛ.Добавить(мДокументЗаправкаСлив.ПутевойЛист);
				КонецЕсли;
			Иначе
				НоваяСтрока.ПутевойЛист = ТаблицаПЛ[0].Ссылка;
				НоваяСтрока.Водитель = ТаблицаПЛ[0].Ссылка.Водитель1;
				Если СписокПЛ.НайтиПоЗначению(НоваяСтрока.ПутевойЛист) = Неопределено Тогда
					СписокПЛ.Добавить(НоваяСтрока.ПутевойЛист);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если флЗаписать Тогда
		Попытка
			Если ПроводитьСозданныеЗаправкиГСМ Тогда
				мДокументЗаправкаСлив.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				мДокументЗаправкаСлив.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СообщениеПредупреждение) Тогда
				СообщениеПредупреждение = СтрШаблон(СообщениеПредупреждение, мДокументЗаправкаСлив);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПредупреждение);
			КонецЕсли;
			
			Если ПроверятьНаличееДублейПоСозданнымРанееДокументам = 2 
				И ВыборкаЗапроса.ЕстьДубли Тогда
				ТекстНСТР = СтрШаблон(НСтр("en='The document ""%1"" ';ru='У документа ""%1"" '"), мДокументЗаправкаСлив.Ссылка) +НСтр("en='there are doubles:';ru='существуют дубли:'")
				+ Символы.ПС + ВыборкаЗапроса.Дубли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			КонецЕсли;
					
			ОбработанныеДокументы.Добавить(мДокументЗаправкаСлив.Ссылка);
			
			Если ФлажокКомментироватьХодВыполнения Тогда
				ТекстНСТР = НСтр("en='Recorded document:';ru='Записан документ:'") + " <" + мДокументЗаправкаСлив + ">";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	флЗаписать = Ложь;
	
	// Слив ГСМ
	Если СоздаватьСливыДляОтрицательныхЗаправок Тогда
		
		КолСтрок	 = мсвВыборкаСливы.Количество();
		Инд			 = 0;
		Дата1		 = '00010101';
		флЗаписать	 = Ложь;
		мОтказ		 = Ложь;
		
		Для Каждого ВыборкаЗапроса Из мсвВыборкаСливы Цикл
			Инд = Инд + 1;
			ЗначениеИндикатора = Инд/КолСтрок * 100;
			
			Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(ВыборкаЗапроса.ТС) Тогда
				Продолжить;
			КонецЕсли;	
			
			Если Дата1 <> ВыборкаЗапроса.Период Тогда
				
				Если Дата1 <> '00010101' Тогда
					Попытка
						Если ПроводитьСозданныеЗаправкиГСМ Тогда
							мДокументЗаправкаСлив.Записать(РежимЗаписиДокумента.Проведение);
						Иначе
							мДокументЗаправкаСлив.Записать(РежимЗаписиДокумента.Запись);
						КонецЕсли;
						Если ПроверятьНаличееДублейПоСозданнымРанееДокументам = 2 
							И ВыборкаЗапроса.ЕстьДубли Тогда
							ТекстНСТР = СтрШаблон(НСтр("en='The document ""%1"" ';ru='У документа ""%1"" '"), мДокументЗаправкаСлив.Ссылка) +НСтр("en='there are doubles:';ru='существуют дубли:'")
							+ Символы.ПС + ВыборкаЗапроса.Дубли;
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
						КонецЕсли;
						ОбработанныеДокументы.Добавить(мДокументЗаправкаСлив.Ссылка);
						
						Если ФлажокКомментироватьХодВыполнения Тогда
							ТекстНСТР = НСтр("en='Recorded document:';ru='Записан документ:'") + " <" + мДокументЗаправкаСлив + ">";
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
						КонецЕсли;
					Исключение
					КонецПопытки;
					
					флЗаписать = Ложь;
				КонецЕсли;
				
				Дата1 = ВыборкаЗапроса.Период;
				
				мДокументЗаправкаСлив = Документы.уатСливГСМ.СоздатьДокумент();
				мДокументЗаправкаСлив.ВидОперации = ВидОперацииСливГСМ;
				
				мДокументЗаправкаСлив.Дата			 = Дата1;
				мДокументЗаправкаСлив.АЗС			 = Объект.АЗС;
				мДокументЗаправкаСлив.Организация	 = Объект.Организация;
				мДокументЗаправкаСлив.Ответственный	 = ТекОтветственный;
				
				флЗаписать = Истина;
				
			КонецЕсли;
			
			мДокументЗаправкаСлив.ГСМ			 = ВыборкаЗапроса.ГСМ;
			мДокументЗаправкаСлив.ТС			 = ВыборкаЗапроса.ТС;
			мДокументЗаправкаСлив.Количество	 = -ВыборкаЗапроса.Количество;
			мДокументЗаправкаСлив.ГСМ			 = ВыборкаЗапроса.ГСМ;
			
			//теперь найдем путевой лист
			ВремяВыезд      = Объект.ГлубинаПоискаПЛДоВыезда;
			ВремяВозврат    = Объект.ГлубинаПоискаПЛПослеВозвращения;
			
			ТаблицаПЛ = уатОбщегоНазначения.уатПутевыеЛистыВыездВозврат(ВыборкаЗапроса.ТС,Дата1, ВремяВыезд, 
			ВремяВозврат, , ?(ОбрабатыватьРассчитанныеПутевыеЛисты, Неопределено, Ложь));
			
			Если ТаблицаПЛ.Количество() > 0 Тогда
				мДокументЗаправкаСлив.ПутевойЛист = ТаблицаПЛ[0].Ссылка;
				Если СписокПЛ.НайтиПоЗначению(мДокументЗаправкаСлив.ПутевойЛист) = Неопределено Тогда
					СписокПЛ.Добавить(мДокументЗаправкаСлив.ПутевойЛист);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	
	Если флЗаписать Тогда
		Попытка
			Если ПроводитьСозданныеЗаправкиГСМ Тогда
				мДокументЗаправкаСлив.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				мДокументЗаправкаСлив.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			Если ПроверятьНаличееДублейПоСозданнымРанееДокументам = 2 
				И ВыборкаЗапроса.ЕстьДубли Тогда
				ТекстНСТР = СтрШаблон(НСтр("en='The document ""%1"" ';ru='У документа ""%1"" '"), мДокументЗаправкаСлив.Ссылка) +НСтр("en='there are doubles:';ru='существуют дубли:'")
				+ Символы.ПС + ВыборкаЗапроса.Дубли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			КонецЕсли;
			ОбработанныеДокументы.Добавить(мДокументЗаправкаСлив.Ссылка);
			
			Если ФлажокКомментироватьХодВыполнения Тогда
				ТекстНСТР = НСтр("en='Recorded document:';ru='Записан документ:'") + " <" + мДокументЗаправкаСлив + ">";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	//обновляем информацию по путевым листам
	ТекстИндикатора = НСтр("en='Updated information in waybills ...';ru='Обновляем информацию в путевых листах ...'");
	
	КолСтрок	 = СписокПЛ.Количество();
	Инд			 = 0;
	
	Для Каждого ТекСтрока Из СписокПЛ Цикл
		Инд = Инд + 1;
		ЗначениеИндикатора = Инд / КолСтрок * 100;
		
		мПутевойЛист	= ТекСтрока.Значение.ПолучитьОбъект();
		мЗаголовок = НСтр("en='Errors in calculation of balance of the work by waybill №';ru='Ошибки при расчете итогов работы по путевому листу №'") + мПутевойЛист.Номер + " :";
		Если ПересчитатьПутевыеЛисты Тогда
			мПутевойЛист.ПересчетВыданногоГСМ();
			мПутевойЛист.ПересчетСданногоГСМ();
			мПутевойЛист.РасчетРасходаГСМ(мЗаголовок, мОтказ);
		Иначе
			мПутевойЛист.Рассчитан	= Ложь;
		КонецЕсли;	
		Если мПутевойЛист.Проведен Тогда
			мРежимЗаписи = РежимЗаписиДокумента.Проведение;
		Иначе
			мРежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
		Попытка
			мПутевойЛист.Записать(мРежимЗаписи);
			ОбработанныеДокументы.Добавить(мПутевойЛист.Ссылка);
			Если ФлажокКомментироватьХодВыполнения Тогда
				ТекстНСТР = НСтр("en='Recorded document:';ru='Записан документ:'") + " <" + мПутевойЛист + ">";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериода(Команда)
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = Объект.ДатаНач;
	ДиалогПериода.Период.ДатаОкончания = Объект.ДатаКон;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Не Период = Неопределено Тогда
		Объект.ДатаНач = Период.ДатаНачала;
		Объект.ДатаКон = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовОбработанныхДокументовФормы

&НаКлиенте
Процедура ОбработанныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДок = Элементы.ОбработанныеДокументы.ТекущиеДанные.Значение;
	Если ЗначениеЗаполнено(ТекДок) Тогда
		ПоказатьЗначение(Неопределено, ТекДок);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработанныеДокументыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ПоказатьЗначение(Неопределено, Элементы.ОбработанныеДокументы.ТекущиеДанные.Значение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовНастороекФормы

&НаКлиенте
Процедура ТолькоПроверенныеПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ОбрабатыватьРассчитанныеПутевыеЛистыПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПутевыеЛистыПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПроводитьСозданныеЗаправкиГСМПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ОткрыватьФормыЗаписанныхЗаправокПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьСливыДляОтрицательныхЗаправокПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ФлажокКомментироватьХодВыполненияПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура СписокГСМПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ГлубинаПоискаПЛДоВыездаПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ГлубинаПоискаПЛПослеВозвращенияПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура АЗСПриИзменении(Элемент)
	
	Объект.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	Если ЗначениеЗаполнено(Объект.АЗС) Тогда
		Объект.Контрагент = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.АЗС, "Контрагент_Склад");
		
		ЭтоАЗСсклад = (уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.АЗС, "ЭтоАЗССклад") = Истина);
		Если ЭтоАЗССклад Тогда
			Объект.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
	СохранитьНастройки();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаКорректности(Знач Оповещение)
	Если Объект.ДатаНач = '00010101' ИЛИ Объект.ДатаКон = '00010101' Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПроверкаКорректностиЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), "Не указан период!");
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаНач > Объект.ДатаКон И Объект.ДатаКон <> '00010101' Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПроверкаКорректностиЗавершениеБольшеДатыконца", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), "Дата начала периода не может быть больше даты конца периода!");
		Возврат;
	КонецЕсли;
	
	Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(Объект.АЗС) Тогда
		Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(Объект.Контрагент) Тогда
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПроверкаКорректностиЗавершениеАЗС", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), "Не выбрана АЗС!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПроверкаКорректностиЗавершениеОрганизация", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), "Не выбрана организация!");
		Возврат;
	КонецЕсли;
	
	флЕстьГСМ = Ложь;
	Для Каждого ТекЭлемент Из СписокГСМ Цикл
		флЕстьГСМ = флЕстьГСМ ИЛИ ТекЭлемент.Пометка;
	КонецЦикла;
	Если НЕ флЕстьГСМ Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПроверкаКорректностиЗавершениеГСМ", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), "Не выбраны виды ГСМ!");
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Оповещение, Истина);
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКорректностиЗавершениеГСМ(ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    
    
    ВыполнитьОбработкуОповещения(Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКорректностиЗавершениеОрганизация(ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    
    
    ВыполнитьОбработкуОповещения(Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКорректностиЗавершениеАЗС(ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    
    
    ВыполнитьОбработкуОповещения(Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКорректностиЗавершениеБольшеДатыконца(ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    
    
    ВыполнитьОбработкуОповещения(Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКорректностиЗавершение(ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    
    
    ВыполнитьОбработкуОповещения(Оповещение, Ложь);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки()
	
	СтруктураНастроек    = ХранилищеНастроекДанныхФорм.Загрузить("Обработка.уатЗагрузитьЗаправкиИзОтчетовПЦ.Форма.ОсновнаяФорма", "уатЗагрузитьЗаправкиИзОтчетовПЦ_ОбщиеНастройки",,Пользователи.АвторизованныйПользователь());
	НастройкиНекорректны = (СтруктураНастроек = Неопределено Или ТипЗнч(СтруктураНастроек) <> Тип("Структура"));
		
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ДатаНач")) Тогда
		Объект.ДатаНач = Дата(1, 1, 1);
	Иначе
		Объект.ДатаНач = СтруктураНастроек.ДатаНач;
	КонецЕсли;
	
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ДатаКон")) Тогда
		Объект.ДатаНач = Дата(1, 1, 1);
	Иначе
		Объект.ДатаКон = СтруктураНастроек.ДатаКон;
	КонецЕсли;
		
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("Организация")) Тогда
		Объект.Организация = Справочники.Организации.ПустаяСсылка();
	Иначе
		Объект.Организация = СтруктураНастроек.Организация;
	КонецЕсли;
	
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("АЗС")) Тогда
		Объект.АЗС = Справочники.уатАЗС.ПустаяСсылка();
	Иначе
		Объект.АЗС = СтруктураНастроек.АЗС;
	КонецЕсли;
	
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("Контрагент")) Тогда
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		Объект.Контрагент = СтруктураНастроек.Контрагент;
	КонецЕсли;
	
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ГлубинаПоискаПЛДоВыезда")) Тогда
		Объект.ГлубинаПоискаПЛДоВыезда = 0;
	Иначе
		Объект.ГлубинаПоискаПЛДоВыезда = СтруктураНастроек.ГлубинаПоискаПЛДоВыезда;
	КонецЕсли;
	
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ГлубинаПоискаПЛПослеВозвращения")) Тогда
		Объект.ГлубинаПоискаПЛПослеВозвращения = 0;
	Иначе
		Объект.ГлубинаПоискаПЛПослеВозвращения = СтруктураНастроек.ГлубинаПоискаПЛПослеВозвращения;
	КонецЕсли;
	
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ТолькоПроверенные")) Тогда
		Объект.ТолькоПроверенные = Ложь;
	Иначе
		Объект.ТолькоПроверенные = СтруктураНастроек.ТолькоПроверенные;
	КонецЕсли;
	
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ОбрабатыватьРассчитанныеПутевыеЛисты")) Тогда
		ОбрабатыватьРассчитанныеПутевыеЛисты = Ложь;
	Иначе
		ОбрабатыватьРассчитанныеПутевыеЛисты = СтруктураНастроек.ОбрабатыватьРассчитанныеПутевыеЛисты;
	КонецЕсли;
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ПересчитатьПутевыеЛисты")) Тогда
		ПересчитатьПутевыеЛисты = Ложь;
	Иначе
		ПересчитатьПутевыеЛисты = СтруктураНастроек.ПересчитатьПутевыеЛисты;
	КонецЕсли;
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ПроводитьСозданныеЗаправкиГСМ")) Тогда
		ПроводитьСозданныеЗаправкиГСМ = Ложь;
	Иначе
		ПроводитьСозданныеЗаправкиГСМ = СтруктураНастроек.ПроводитьСозданныеЗаправкиГСМ;
	КонецЕсли;
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ОткрыватьФормыЗаписанныхЗаправок")) Тогда
		ОткрыватьФормыЗаписанныхЗаправок = Ложь;
	Иначе
		ОткрыватьФормыЗаписанныхЗаправок = СтруктураНастроек.ОткрыватьФормыЗаписанныхЗаправок;
	КонецЕсли;
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("СоздаватьСливыДляОтрицательныхЗаправок")) Тогда
		СоздаватьСливыДляОтрицательныхЗаправок = Ложь;
	Иначе
		СоздаватьСливыДляОтрицательныхЗаправок = СтруктураНастроек.СоздаватьСливыДляОтрицательныхЗаправок;
	КонецЕсли;
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ФлажокКомментироватьХодВыполнения")) Тогда
		ФлажокКомментироватьХодВыполнения = Ложь;
	Иначе
		ФлажокКомментироватьХодВыполнения = СтруктураНастроек.ФлажокКомментироватьХодВыполнения;
	КонецЕсли;
	
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("ПроверятьНаличееДублейПоСозданнымРанееДокументам")) Тогда
		ПроверятьНаличееДублейПоСозданнымРанееДокументам = 0;
	Иначе
		ПроверятьНаличееДублейПоСозданнымРанееДокументам = СтруктураНастроек.ПроверятьНаличееДублейПоСозданнымРанееДокументам;
	КонецЕсли;
	
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("СписокГСМ")) Тогда
		
	Иначе
		Для Каждого ТекГСМ Из СписокГСМ Цикл
			НайденноеГСМ = СтруктураНастроек.СписокГСМ.НайтиПоЗначению(ТекГСМ.Значение);
			Если НайденноеГСМ <> Неопределено Тогда
				ТекГСМ.Пометка = НайденноеГСМ.Пометка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НастройкиНекорректны Или (Не СтруктураНастроек.Свойство("СписокТК")) Тогда
		
	Иначе
		Для Каждого ТекТК Из СписокТК Цикл
			НайденноеТК = СтруктураНастроек.СписокТК.НайтиПоЗначению(ТекТК.Значение);
			Если НайденноеТК <> Неопределено Тогда
				ТекТК.Пометка = НайденноеТК.Пометка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ТолькоПроверенные",                      Объект.ТолькоПроверенные);
	СтруктураНастроек.Вставить("ОбрабатыватьРассчитанныеПутевыеЛисты",   ОбрабатыватьРассчитанныеПутевыеЛисты);
	СтруктураНастроек.Вставить("ПересчитатьПутевыеЛисты",                ПересчитатьПутевыеЛисты);
	СтруктураНастроек.Вставить("ПроводитьСозданныеЗаправкиГСМ",          ПроводитьСозданныеЗаправкиГСМ);
	СтруктураНастроек.Вставить("ОткрыватьФормыЗаписанныхЗаправок",       ОткрыватьФормыЗаписанныхЗаправок);
	СтруктураНастроек.Вставить("СоздаватьСливыДляОтрицательныхЗаправок", СоздаватьСливыДляОтрицательныхЗаправок);
	СтруктураНастроек.Вставить("ФлажокКомментироватьХодВыполнения",      ФлажокКомментироватьХодВыполнения);
	СтруктураНастроек.Вставить("ДатаНач",                                Объект.ДатаНач);
	СтруктураНастроек.Вставить("ДатаКон",                                Объект.ДатаКон);
	СтруктураНастроек.Вставить("Организация",                            Объект.Организация);
	СтруктураНастроек.Вставить("АЗС",                                    Объект.АЗС);
	СтруктураНастроек.Вставить("ГлубинаПоискаПЛДоВыезда",                Объект.ГлубинаПоискаПЛДоВыезда);
	СтруктураНастроек.Вставить("ГлубинаПоискаПЛПослеВозвращения",        Объект.ГлубинаПоискаПЛПослеВозвращения);
	СтруктураНастроек.Вставить("ПроверятьНаличееДублейПоСозданнымРанееДокументам",        ПроверятьНаличееДублейПоСозданнымРанееДокументам);
	СтруктураНастроек.Вставить("Контрагент",                            Объект.Контрагент);

	СтруктураНастроек.Вставить("СписокГСМ", СписокГСМ);
	СтруктураНастроек.Вставить("СписокТК",  СписокТК);
	
	ХранилищеНастроекДанныхФорм.Сохранить("Обработка.уатЗагрузитьЗаправкиИзОтчетовПЦ.Форма.ОсновнаяФорма", "уатЗагрузитьЗаправкиИзОтчетовПЦ_ОбщиеНастройки",
								СтруктураНастроек,,Пользователи.АвторизованныйПользователь());
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТКПоОтбору(Список, ВидОтбора, Отбор)
	Для Каждого ТекТК Из Список Цикл
		ТекТК.Пометка = ТекТК.Значение[ВидОтбора] = Отбор;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНаличиеДублей(ДатаЗаправки, АЗС, Контрагент, Организация, ГСМ, ТС, ПластиковаяКарта, Количество, ТекстСообщения = "")
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатОборотыПоЗаправкамГСМ.Регистратор.Представление КАК РегистраторПредставление
	               |ИЗ
	               |	РегистрНакопления.уатОборотыПоЗаправкамГСМ КАК уатОборотыПоЗаправкамГСМ
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(уатОборотыПоЗаправкамГСМ.Регистратор) = ТИП(Документ.уатЗаправкаГСМ)
	               |	И уатОборотыПоЗаправкамГСМ.Организация = &Организация
	               |	И уатОборотыПоЗаправкамГСМ.ГСМ = &ГСМ
	               |	И уатОборотыПоЗаправкамГСМ.АЗС = &АЗС
	               |	И уатОборотыПоЗаправкамГСМ.ПластиковаяКарта = &ПластиковаяКарта
	               |	И уатОборотыПоЗаправкамГСМ.ТС = &ТС
	               |	И уатОборотыПоЗаправкамГСМ.Количество = &Количество
	               |	И ВЫБОР
	               |			КОГДА уатОборотыПоЗаправкамГСМ.Регистратор.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	               |				ТОГДА уатОборотыПоЗаправкамГСМ.Регистратор.ДоговорКонтрагента.Контрагент = &Контрагент
	               |			ИНАЧЕ уатОборотыПоЗаправкамГСМ.Регистратор.АЗС.Контрагент_Склад = &Контрагент
	               |		КОНЕЦ
	               |	И уатОборотыПоЗаправкамГСМ.Период = &ДатаЗаправки";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаЗаправки", ДатаЗаправки);
	Запрос.УстановитьПараметр("АЗС", АЗС);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ГСМ", ГСМ);
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("ПластиковаяКарта", ПластиковаяКарта);
	Запрос.УстановитьПараметр("Количество", Количество);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ?(ТекстСообщения = "", Выборка.РегистраторПредставление, ТекстСообщения + ", " + Выборка.РегистраторПредставление);
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьНаличиеДублейСливы(ДатаЗаправки, АЗС, Организация, ГСМ, ТС, Количество, ТекстСообщения = "")
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатСливГСМ.Представление КАК Представление
	               |ИЗ
	               |	Документ.уатСливГСМ КАК уатСливГСМ
	               |ГДЕ
	               |	уатСливГСМ.Организация = &Организация
	               |	И уатСливГСМ.АЗС = &АЗС
	               |	И уатСливГСМ.ГСМ = &ГСМ
	               |	И уатСливГСМ.ТС = &ТС
	               |	И уатСливГСМ.Количество = &Количество
	               |	И уатСливГСМ.Проведен = ИСТИНА
	               |	И уатСливГСМ.Дата = &Дата";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", ДатаЗаправки);
	Запрос.УстановитьПараметр("АЗС", АЗС);
	Запрос.УстановитьПараметр("ГСМ", ГСМ);
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("Количество", Количество);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ?(ТекстСообщения = "", Выборка.Представление, ТекстСообщения + ", " + Выборка.Представление);
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
